In [2]:
import Covid

/home/baddy/Dev-Gaurav/tests/COVID/Covid.py:50: GuessedAtParserWarning: No parser was explicitly specified, so I'm using the best available HTML parser for this system ("lxml"). This usually isn't a problem, but if you run this code on another system, or in a different virtual environment, it may use a different parser and behave differently.

The code that caused this warning is on line 50 of the file /home/baddy/Dev-Gaurav/tests/COVID/Covid.py. To get rid of this warning, pass the additional argument 'features="lxml"' to the BeautifulSoup constructor.

  soup = BeautifulSoup(html)

In [4]:
data = Covid.active()

In [6]:
data.head(10)

     Date  Active_cases
0  Jan 22         592.0
1  Jan 23         817.0
2  Jan 24        1270.0
3  Jan 25        1943.0
4  Jan 26        2704.0
5  Jan 27        4454.0
6  Jan 28        5863.0
7  Jan 29        7563.0
8  Jan 30        9485.0
9  Jan 31       11499.0

In [7]:
def crop(date):
    return date[-2:]

In [8]:
data["date"] = data.Date.apply(crop)

In [9]:
data

       Date  Active_cases date
0    Jan 22         592.0   22
1    Jan 23         817.0   23
2    Jan 24        1270.0   24
3    Jan 25        1943.0   25
4    Jan 26        2704.0   26
..      ...           ...  ...
311  Nov 28    17932146.0   28
312  Nov 29    18087782.0   29
313  Nov 30    18145177.0   30
314  Dec 01    18261803.0   01
315  Dec 02    18398174.0   02

[316 rows x 3 columns]

In [10]:
data[["date","Active_cases"]]

    date  Active_cases
0     22         592.0
1     23         817.0
2     24        1270.0
3     25        1943.0
4     26        2704.0
..   ...           ...
311   28    17932146.0
312   29    18087782.0
313   30    18145177.0
314   01    18261803.0
315   02    18398174.0

[316 rows x 2 columns]

In [12]:
Covid.Track()

,country,total_cases,new_cases,total_death,new_deaths,recovered,active_cases,critical,total_cases/10Lakhs,total_death/10lakhs,total_tests,total_test/10lakhs,population
0,North America,16645805,"+11,775",416734,+808,10209853,6019218,30889,0,0,0,0,0
1,Asia,17014742,"+14,060",295296,+146,15089506,1629940,27815,0,0,0,0,0
2,South America,11287528,+184,327958,+9,10096356,863214,17052,0,0,0,0,0
3,Europe,17695628,"+54,766",406761,"+1,121",7688858,9600009,28296,0,0,0,0,0
4,Africa,2214586,,52670,,1876437,285479,2594,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
693,Western Sahara,10,,1,,8,1,0,17,2,0,0,603431
694,MS Zaandam,9,,2,,0,7,0,0,0,0,0,0
695,Anguilla,6,,0,,3,3,0,398,0,2651,176041,15059
696,Marshall Islands,4,,0,,4,0,0,67,0,0,0,59359
697,Wallis and Futuna,3,,0,,1,2,0,269,0,1149,103012,11154